-ifndef(COURT_ORDER_HRL).
-define(COURT_ORDER_HRL, true).

% Продукт: МІА: Документообіг
% Розширення: МІА: Провадження
% Документ-об'єкт: Ухвала Суду
% На підставі: https://zakon.rada.gov.ua/laws/show/z0860-06

-include_lib("schema/include/erp/catalogs/dict.hrl").
-include_lib("schema/include/erp/catalogs/person.hrl").
-include_lib("schema/include/erp/catalogs/crimesParty.hrl").
-include_lib("schema/include/erp/catalogs/location.hrl").
-include_lib("schema/include/erp/catalogs/organization.hrl").
-include_lib("schema/include/erp/catalogs/address.hrl").

-record(courtOrder, {
    id= [] :: binary(),
    guid= [] :: list(),
    courtOrderType = [] :: [] | binary(), % Вид ухвали
    asAnswerToPetition = [] :: [] | #petition{}, % Посилання на РКК клопотання
    regNum = [] :: [] | binary(), % Реєстраційний номер ухвали
    regDate = [] :: [] | calendar:datetime(), % Дата винесення ухвали
    court = [] :: [] | #'Organization'{}, % Суд
    judge = [] :: [] | #'Employee'{}, % Слідчий суддя
    courtOrderReceived = [] :: [] | calendar:datetime(), % Дата надходження ухвали
    suspect = [] :: [] | #crimesParty{}, % Підозрюваний / обвинувачений, відносно якого розглянуто клопотання
    courtOrderTerm = [] :: [] | calendar:datetime(), % Строк дії ухвали
    bailAmount = 0 :: [] | integer(), % Призначено застава (сума)
    appealDueDate = [] :: [] | calendar:datetime(),  % Строк для оскарження
    duties = [] :: [] | list({#dict{},binary()}), % Обов'язки покладені при внесенні застави
    appeals = [] :: [] | list({#dict{},binary()}), % Перелік підстав для оскарження
    attachments = [] :: list(#fileDesc{}), % Файли-додатки
    etc = [],
    seq_id = [] :: [] | binary()
    }).

% Форми докментів:
% ДОДАТОК 3  Матеріали кримінального провадження (з обвинувальним актом, клопотанням про застосування примусових заходів медичного характеру, клопотанням про застосування примусових заходів виховного характеру, клопотанням про звільнення від кримінальної відповідальності)
% ДОДАТОК 5  Про перегляд судового рішення за нововиявленими обставинами
% ДОДАТОК 6  Про відновлення втрачених матеріалів кримінального провадження
% ДОДАТОК 7  Клопотання, скаргу, заяву (клопотання слідчого чи прокурора та інших осіб; скарги на дії, рішення чи бездіяльність слідчого, прокурора та інших осіб; заяви про відвід)
% ДОДАТОК 17 Заява про перегляд рішення (ухвали, судового наказу) у цивільних справах за новивиявленими обставинами

% Журнали документів використані в розширенні МІА: Провадження:
% /court/system/civil         -- Журнал обліку подань, заяв і клопотань у порядку виконання судових рішень у цивільних справах (Додаток)
% /court/system/admin         -- Журнал обліку подань, заяв і клопотань у порядку виконання судових рішень в адміністративних справах (Додаток)
% /court/system/control       -- Контрольний жЖурнал судових справ і матеріалів, переданих для розгляду судді (Додаток 31)
% /court/system/appealCrime   -- Журнал обліку апеляційних скарг в кримінальному провадженні
% /court/system/appealCivil   -- Журнал обліку заяв про апеляційне оскарження, апеляційних скарг у цивільних чи адміністративних справах
% /court/system/bail          -- Журнал обліку осіб, яких передано на поруки колективу підприємств, установ, організацій
% /court/system/crimeInqOut   -- Журнал видачі справ (матеріалів кримінального провадження) для ознайомлення

-endif.
