-ifndef(CRIMES_PARTY_HRL).
-define(CRIMES_PARTY_HRL, true).

% Категорія: Словники Документообігу
% Модуль: МІА: Провадження
% Довідник: Учасники Провадження
% Автори: Олександр Андроник, Максим Сохацький

% /crimes/parties
% /crimes/partyType
% /crimes/education
% /crimes/familyType
% /crimes/special
% /crimes/penalty
% /crimes/roles/attorney
% /crimes/roles/prosecutor
% /crimes/roles/court
% /crimes/roles/victim
% /crimes/roles/other

-record(crimesConviction, {
    id = [] :: list(),                            % Ідентифікатор судимості
    dateIssued = [] :: [] | calendar:datetime(),  % Дата набуття законної сили
    court = [] :: [] | binary(),                  % Суд
    crime = [] :: [] | binary(),                  % Злочин за який було засуджено (/crimes/index)
    penalty = [] :: [] | binary(),                % Вид покарання (/crimes/penalty)
    term = [] :: [] | {'money', integer(), integer()} | {'date', integer(), integer()}, % Строк/Сума покарання та його тип
    nationality = [] :: [] | binary(),            % Національність
    citizenship = [] :: [] | binary(),            % Громадянство
    identifying = [] :: [] | binary(),            % Документ, що посвідчує особу
    rntrc = [] :: [] | binary(),                  % РНОКПП
    etc = []
    }).

-record(crimesParty, {
    id = [] :: list(),                              % Стаття
    type = [] :: binary(),                          % Тип учасника
    dateTyped = [] :: [] | calendar:datetime(),     % Дата набуття типу
    name = [] :: binary() | list(),                 % Ім'я
    related = [] :: [] | list(#crimesParty{}),      % Глобальні пов'язані карточки учасників
    middlename = [] :: [] | binary(),               % По-батькові
    surname = [] :: [] | binary(),                  % Прізвище
    birthday = [] :: [] | calendar:datetime(),      % Дата народження
    ageNow = [] :: [] | calendar:datetime(),        % Вік на даний час
    adultNow = true :: [] | boolean(),              % Повнолітність на даний час
    ageCrime = [] :: [] | calendar:datetime(),      % Вік на момент вчинення злочину
    adultCrime = true :: [] | boolean(),            % Повнолітність на момент вчинення злочину
    sex = [] :: list(),                             % Стать
    addressActual = [] :: list(),                   % Адреса фактичного місця проживання
    addressFormal = [] :: list(),                   % Адреса реєстрації
    job = [] :: list(),                             % Місце роботи
    position = [] :: list(),                        % Посада
    education = [] :: list(),                       % Освіта (/crimes/education)
    familyType = [] :: list(),                      % Сімейний стан (/crimes/familyType)
    special = [] :: [] | binary(),                  % Спеціальний статус особи (/crimes/special)
    conviction = false :: [] | boolean(),           % Судимість (так/ні/не встановлено)
    convictions = [] :: list(#crimesConviction{}),  % Перелік судимостей
    etc = []
    }).

% /crimes/education
% "дошкільна освіта"
% "початкова освіта"
% "базова середня освіта"
% "профільна середня освіта"
% "професійна (професійно-технічна) освіта"
% "перший (бакалаврський) рівень вищої освіти"
% "другий (магістерський) рівень вищої освіти"
% "третій (освітньо-науковий/освітньо-творчий) рівень вищої освіти"
% "науковий рівень вищої освіти"

% /crimes/familyType
% Неодружений / незаміжня
% Одружений /з аміжня
% Розлучений(а)
% Вдівець / вдова

% /crimes/special
% Народний депутат України
% Суддя
% Кандидат у Пезиденти України
% Уповноважений ВРУ з прав людини
% Голова або член Рахункової палати
% Депутат місцевої ради
% Сільський, селищний, міський голова
% Адвокат
% Генеральний прокурор або його заступник
% Прокурор САП
% Директор або працівник НАБУ
% Член НАЗК
% Правоохоронець
% Державний службовець, службовець ОМС, інша прирівняна особа
% Жоден

% /crimes/penalty
% Штраф
% Громадські роботи
% Виправні роботи
% Службові обмеження для військовослужбовців
% Арешт
% Обмеження волі
% Тримання в дисциплінарному батальйоні військовослужбовців
% Позбавлення волі
% Довічне позбавлення волі

% /crimes/roles/attorney
% Затриманий
% Підозрюваний
% Обвинувачений
% Законний представник
% захисник

% /crimes/roles/prosecutor
% Керівник ОДР
% Керівник прокуратури
% Прокурор
% Слідчий
% Оперативний співробітник

% /crimes/roles/court
% Суддя
% Слідчий суддя

% /crimes/roles/victim
% Потерпілий
% Представник
% Законний представник

% /crimes/roles/other
% Заявник
% Представник юридичної особи
% Третя особа
% Свідок
% Понятий
% Експерт
% Перекладач
% Спеціаліст
% Лікар
% Педагог
% Психолог
% Представник
% Законний представник
% Статист
% «Довільний учасник»

-endif.