-ifndef(CRIMES_HRL).
-define(CRIMES_HRL, true).

% Категорія: Словники Документообігу
% Модуль: МІА: Провадження
% Довідник: Кваліфікація статей Кримінального Кодексу
% Автори: Олександр Андроник, Максим Сохацький

% /crimes/index
% /crimes/object
% /crimes/subject
% /crimes/severity
% /crimes/types
% /crimes/demages
% /crimes/corpusDelicti

-record(crimes, {
    id = [] :: list(),                        % Стаття
    code = [] :: binary(),                    % Код
    name = [] :: binary() | list(),           % Назва статті
    part = [] :: binary(),                    % Частина статті
    disposition = [] :: binary(),             % Диспозиція частини статті
    severity = [] :: binary(),                % Тяжкість злочину (/crimes/severity)
    object = [] :: list(),                    % Об'єкт посягання (/crimes/object)
    subject = [] :: list(),                   % Суб'єкт (загальний, спеціальний, dict)
    keywords = [] :: list(),                  % Ключові слова
    stopwords = [] :: list(),                 % Стоп слова
    corpusDelicti = [] :: list() | binary(),  % Формальний чи матеріальний склад злочину (/crimes/corpusDelicti)
    lifetime = false :: [] | boolean(),       % Передбачено довічне позбавлення волі
    confiscation = false :: [] | boolean(),   % Конфіскація майна
    postDeny = false :: [] | boolean(),       % Позбавлення звання
    private = false :: [] | boolean(),        % Приватне обвинувачення
    murderAttempt = false :: [] | boolean(),  % Можливий замах
    minAge = [] :: integer(),                 % Мінімальний вік підозрюваного
    qualify28_1 = [] :: list() | binary(),    % Кваліфікація ст. 28, ч. 1
    qualify28_2 = [] :: list() | binary(),    % Кваліфікація ст. 28, ч. 2
    qualify28_3 = [] :: list() | binary(),    % Кваліфікація ст. 28, ч. 3
    qualify28_4 = [] :: list() | binary(),    % Кваліфікація ст. 28, ч. 4
    imprisonment = false :: [] | boolean(),   % Передбачено позбавлення волі
    imprisonment_min = [] :: [] | integer(),  % Строк (мін, роки)
    imprisonmentmax = [] :: [] | integer(),   % Строк (макс, роки)
    mdb = false :: [] | boolean(),            % Тримання в ДБВ
    mdb_min  = [] :: [] | integer(),          % ДБВ (мін, в роках, від 6 міс)
    mdb_max  = [] :: [] | integer(),          % ДБВ (макс)
    restriction = false :: [] | boolean(),    % Передбачено обмеження волі
    restriction_min = [] :: [] | integer(),   % Обмеження (мін, в роках)
    restriction_max = [] :: [] | integer(),   % Обмеження (макс, в роках)
    arrest = false :: [] | boolean(),         % Арешт
    arrest_min = [] :: [] | integer(),        % Арешт (мін)
    arrest_max = [] :: [] | integer(),        % Арешт (макс)
    mdr = false :: [] | boolean(),            % Службові обмеження військовослужбовців
    mdr_min  = [] :: [] | integer(),          % СОВ (мін)
    mdr_max  = [] :: [] | integer(),          % СОВ (макс)
    correctional = false :: [] | boolean(),   % Виправні роботи
    correctional_min  = [] :: [] | integer(), % Виправні роботи (мін)
    correctional_max  = [] :: [] | integer(), % Виправні роботи (макс)
    civil = false :: [] | boolean(),          % Виправні роботи
    civil_min  = [] :: [] | integer(),        % Виправні роботи (мін)
    civil_max  = [] :: [] | integer(),        % Виправні роботи (макс)
    seatDeny = false :: [] | boolean(),       % Позбавлення обіймати посади (ПОП)
    seatDeny_min  = [] :: [] | integer(),     % ПОП (мін)
    seatDeny_max  = [] :: [] | integer(),     % ПОП (макс)
    penalty = false :: [] | boolean(),        % Штраф
    penalty_min = [] :: [] | integer(),       % Штраф (мін)
    penalty_max = [] :: [] | integer(),       % Штраф (макс)
    demages = [] :: list(),                   % Вид шкоди (моральна, фізична, майнова, dict)
    demages_min  = [] :: [] | integer(),      % Шкода для кваліфікації (мін)
    demages_max  = [] :: [] | integer(),      % Шкода для кваліфікації (макс)
    etc = []
    }).

% /crimes/object
% Національна безпека держави
% Життя особи
% Здоров'я особи
% Життя і здоров'я особи
% Воля і гідність людини
% Статева свобода чи статева недоторканість особи
% Виборче право 
% Конституційне право громадян на таємницю листування, телефонних розмов, телеграфної та іншої кореспонденції
% Інтереси сім'ї та дітей, яких було усиновлено (їх всебічний фізичний, психічний та соціальний розвиток)
% Конституційне право громадян на свободу об'єднання у професійні спілки, політичні партії та громадські організації
% Всебічний (фізичний, психічний і соціальний) розвиток дитини або особи, стосовно якої встановлена опіка чи піклування, а також встановлений порядок догляду за такими особами
% Суспільні відносини у сфері господарської діяльності, пов'язаної з виробництвом, експортом, імпортом дисків для лазерних систем зчитування, матриць
% Трудові права людини
% Авторське право та суміжні права
% Порядок проповідування релігійних віровчень та відправлення релігійних обрядів
% Право непрацездатних батьків на їх утримання їхніми дітьми
% Право громадянина на недоторканність приватного життя, особисту та сімейну таємницю
% Право громадян на освіту
% Право громадян на охорону здоров'я та медичну допомогу
% Право людини на свободу віросповідання
% Право неповнолітніх дітей на повноцінне життя та всебічний (фізичний, психічний і соціальний)
% Право на недоторканність житла
% Правосуддя, порядок здійснення правосуддя та виконання рішення суду
% Свобода здійснення журналістської діяльності
% Власність
% Власність, життя та здоров’я особи
% Встановлений порядок здійснення законної професійної діяльності журналістів
% Встановлений порядок переміщення відповідних предметів через митний кордон України
% Встановлений порядок зайняття господарською діяльністю
% Встановлений порядок несення військової служби
% Встановлений порядок здійснення підсприємницької діяльністю
% Використанні опіки чи піклування на шкоду підопічному, що суперечить призначенню інституту опіки та піклування
% Авторитет органів державної влади та місцевого самоврядування
% Безпека виробництва
% Безпека руху та експлуатації транспорту
% Власність громадського діяча
% Громадська безпека
% Громадський порядок та моральність
% Екологічна безпека держави
% Мир та безпека людства, міжнародний правопорядок
% Особиста воля
% Особиста безпека особи
% Особиста свобода дитини та сім'я
% Особиста свобода, фізичне і психічне здоров'я дитини
% Порядок обігу наркотичних засобів, психотропних речовин, їх аналогів або прекурсорів
% Порядок використання електронно-обчислювальних машин (комп'ютерів), систем та комп'ютерних мереж і мереж електрозв'язку
% Порядок виконання державного і місцевих бюджетів
% Порядок доступу до державної таємниці та інформації з обмеженим доступом
% Порядок здійснення господарської діяльності в частині забезпечення чесної конкуренції між її суб'єктами
% Порядок здійснення операцій з металобрухтом
% Порядок здійснення службової та професійної діяльності
% Порядок оподаткування юридичних і фізичних осіб
% Порядок охорони і використання знаків для товарів і послуг, фірмових найменувань та маркування товарів, засади добросовісної конкуренції
% Порядок проповідування релігійних віровчень та відправлення релігійних обрядів
% Порядок сплати акцизного збору
% Порядок фінансування, кредитування і оподаткування господарської діяльності, права і законні інтереси кредиторів.
% Порядок виробництва й обігу підакцизних товарів
% Порядок формування і функціонування грошової системи України
% Порядок виготовлення, використання та обігу документів на переказ, платіжних карток чи інших засобів доступу до банківських рахунків

% /crimes/subject
% Загальний
% Спеціальний

% /crimes/severity
% Невеликої тяжкості
% Середньої тяжкості
% Тяжкий
% Особливо тяжкий

-endif.
